pet_examples/evaluation/model_comp_corr/gpt3/mermaid/rules/5_2.mmd
graph LR
startevent:((startevent)) --> 1:task:(Submit Vacation Request) 
1:task: --> 2:exclusivegateway:{x} 
2:exclusivegateway:--> |Approved?|3:task:(Notify HR Representative) --> 5:endevent:((endevent))
2:exclusivegateway: --> |Rejected?|4:task:(Return Request to Applicant) --> 6:endevent:((endevent))
